src/Reports/ВыпускПродукцииПоПериодам/ВыпускПродукцииПоПериодам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ВыпускПродукцииПоПериодам</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
</mdclass:Report>

src/AccumulationRegisters/ПланыВыпуска/ПланыВыпуска.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПланыВыпуска</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Линейка</name>
    <type>
      <types>CatalogRef.Линейки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МаршрутнаяКарта</name>
    <type>
      <types>DocumentRef.МаршрутнаяКарта</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Reports/ВыпускПродукцииПоПериодам/Forms/ФормаОтчета/Module.bsl
&НаСервере
Процедура СформироватьНаСервере()
ТабДок.Очистить();

СписокПериодов = Новый СписокЗначений;
ТаблицаВыпуска = Новый ТаблицаЗначений;

ТаблицаВыпуска.Колонки.Добавить("Наименование",Новый ОписаниеТипов("Строка"));
ТаблицаВыпуска.Колонки.Добавить("Продукция",Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
ТаблицаВыпуска.Колонки.Добавить("Линейка",Новый ОписаниеТипов("СправочникСсылка.Линейки"));
ТаблицаВыпуска.Колонки.Добавить("Дата",Новый ОписаниеТипов("Дата"));
ТаблицаВыпуска.Колонки.Добавить("Количество",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(14,3)));

ОбъектЗн = РеквизитФормыВЗначение("Отчет");
Макет = ОбъектЗн.ПолучитьМакет("Макет");

ОблШапкаОбщие = Макет.ПолучитьОбласть("Шапка|Общие");
ОблПродукцияОбщие = Макет.ПолучитьОбласть("Продукция|Общие");
ОблКонецОбщие = Макет.ПолучитьОбласть("Конец|Общие");
ОблШапкаПериод = Макет.ПолучитьОбласть("Шапка|Период");
ОблПродукцияПериод = Макет.ПолучитьОбласть("Продукция|Период");
ОблКонецПериод = Макет.ПолучитьОбласть("Конец|Период");
ОблШапкаИтого = Макет.ПолучитьОбласть("Шапка|Итого");
ОблПродукцияИтого = Макет.ПолучитьОбласть("Продукция|Итого");
ОблКонецИтого = Макет.ПолучитьОбласть("Конец|Итого");

Запрос = Новый Запрос;

	Если Периодичность = 0 Тогда
	ФорматДаты = "ДФ='dd.MM.yy ЧЧ'";
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыВыпускаОбороты.Номенклатура КАК Номенклатура,
		|	ПланыВыпускаОбороты.КоличествоРасход КАК КоличествоРасход,
		|	ПланыВыпускаОбороты.Период КАК Период,
		|	ПланыВыпускаОбороты.Номенклатура.Линейка КАК Линейка
		|ИЗ
		|	РегистрНакопления.ПланыВыпуска.Обороты(&ДатаНач, &ДатаКон, Час, ) КАК ПланыВыпускаОбороты
		|ГДЕ
		|	ПланыВыпускаОбороты.МаршрутнаяКарта.Ремонт = ЛОЖЬ";
		Если СписокЛинеек.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОбороты.МаршрутнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
		КонецЕсли; 
			Если ГруппыНоменклатуры.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОбороты.Номенклатура В ИЕРАРХИИ(&ГруппыНоменклатуры)";
			КонецЕсли;
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Период
									|ИТОГИ СУММА(КоличествоРасход)
									|ПО Номенклатура, Период ПЕРИОДАМИ(ЧАС, , )";
	ИначеЕсли Периодичность = 1 Тогда
	ФорматДаты = "ДФ=dd.MM.yy";
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыВыпускаОбороты.Номенклатура КАК Номенклатура,
		|	ПланыВыпускаОбороты.КоличествоРасход КАК КоличествоРасход,
		|	ПланыВыпускаОбороты.Период КАК Период,
		|	ПланыВыпускаОбороты.Номенклатура.Линейка КАК Линейка
		|ИЗ
		|	РегистрНакопления.ПланыВыпуска.Обороты(&ДатаНач, &ДатаКон, День, ) КАК ПланыВыпускаОбороты
		|ГДЕ
		|	ПланыВыпускаОбороты.МаршрутнаяКарта.Ремонт = ЛОЖЬ";
		Если СписокЛинеек.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОбороты.МаршрутнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
		КонецЕсли;
			Если ГруппыНоменклатуры.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОбороты.Номенклатура В ИЕРАРХИИ(&ГруппыНоменклатуры)";
			КонецЕсли;
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Период
									|ИТОГИ СУММА(КоличествоРасход)
									|ПО Номенклатура, Период ПЕРИОДАМИ(ДЕНЬ, , )"; 
	ИначеЕсли Периодичность = 2 Тогда
	ФорматДаты = "ДФ=dd.MM.yy";
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыВыпускаОбороты.Номенклатура КАК Номенклатура,
		|	ПланыВыпускаОбороты.КоличествоРасход КАК КоличествоРасход,
		|	ПланыВыпускаОбороты.Период КАК Период,
		|	ПланыВыпускаОбороты.Номенклатура.Линейка КАК Линейка
		|ИЗ
		|	РегистрНакопления.ПланыВыпуска.Обороты(&ДатаНач, &ДатаКон, Неделя, ) КАК ПланыВыпускаОбороты
		|ГДЕ
		|	ПланыВыпускаОбороты.МаршрутнаяКарта.Ремонт = ЛОЖЬ";
		Если СписокЛинеек.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОбороты.МаршрутнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
		КонецЕсли;
			Если ГруппыНоменклатуры.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОбороты.Номенклатура В ИЕРАРХИИ(&ГруппыНоменклатуры)";
			КонецЕсли;
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Период
									|ИТОГИ СУММА(КоличествоРасход)
									|ПО Номенклатура, Период ПЕРИОДАМИ(НЕДЕЛЯ, , )";
	ИначеЕсли Периодичность = 3 Тогда
	ФорматДаты = "ДФ=MM.yy";
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПланыВыпускаОбороты.Номенклатура КАК Номенклатура,
		|	ПланыВыпускаОбороты.КоличествоРасход КАК КоличествоРасход,
		|	ПланыВыпускаОбороты.Период КАК Период,
		|	ПланыВыпускаОбороты.Номенклатура.Линейка КАК Линейка
		|ИЗ
		|	РегистрНакопления.ПланыВыпуска.Обороты(&ДатаНач, &ДатаКон, Месяц, ) КАК ПланыВыпускаОбороты
		|ГДЕ
		|	ПланыВыпускаОбороты.МаршрутнаяКарта.Ремонт = ЛОЖЬ";		
		Если СписокЛинеек.Количество() > 0 Тогда
		Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОбороты.МаршрутнаяКарта.Линейка В ИЕРАРХИИ(&СписокЛинеек)";
		КонецЕсли;
			Если ГруппыНоменклатуры.Количество() > 0 Тогда
			Запрос.Текст = Запрос.Текст + " И ПланыВыпускаОбороты.Номенклатура В ИЕРАРХИИ(&ГруппыНоменклатуры)";
			КонецЕсли;
	Запрос.Текст = Запрос.Текст + " УПОРЯДОЧИТЬ ПО Период
									|ИТОГИ СУММА(КоличествоРасход)
									|ПО Номенклатура, Период ПЕРИОДАМИ(МЕСЯЦ, , )";
	КонецЕсли; 
Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Отчет.Период.ДатаНачала));
Запрос.УстановитьПараметр("ДатаКон", КонецДня(Отчет.Период.ДатаОкончания));
Запрос.УстановитьПараметр("СписокЛинеек", СписокЛинеек);
Запрос.УстановитьПараметр("ГруппыНоменклатуры", ГруппыНоменклатуры);
РезультатЗапроса = Запрос.Выполнить();
ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНоменклатура.Следующий() Цикл
	ВыборкаПериод = ВыборкаНоменклатура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период","ВСЕ");
		Пока ВыборкаПериод.Следующий() Цикл
			Если СписокПериодов.НайтиПоЗначению(ВыборкаПериод.Период) = Неопределено Тогда
			СписокПериодов.Добавить(ВыборкаПериод.Период);
			КонецЕсли;
		ТЧ = ТаблицаВыпуска.Добавить();
		ТЧ.Линейка = ВыборкаНоменклатура.Линейка;
			Если ВыводитьБезОбозначений Тогда
			ТЧ.Наименование = глНаименованиеВСкобкахБезЭтапа(ВыборкаНоменклатура.Номенклатура.Наименование);
			Иначе
			ТЧ.Наименование = СокрЛП(ВыборкаНоменклатура.Номенклатура.Наименование);
			КонецЕсли; 
		ТЧ.Продукция = ВыборкаНоменклатура.Номенклатура;
		ТЧ.Дата = ВыборкаПериод.Период;
		ТЧ.Количество = ВыборкаПериод.КоличествоРасход;
		КонецЦикла; 
	КонецЦикла;
ТаблицаВыпуска.Сортировать("Линейка,Наименование,Продукция,Дата");
СписокПериодов.СортироватьПоЗначению();
ОблШапкаОбщие.Параметры.ДатаНач = Формат(Отчет.Период.ДатаНачала,"ДФ=dd.MM.yyyy");
ОблШапкаОбщие.Параметры.ДатаКон = Формат(Отчет.Период.ДатаОкончания,"ДФ=dd.MM.yyyy");
ТабДок.Вывести(ОблШапкаОбщие);
	Для каждого Стр Из СписокПериодов Цикл
		Если Периодичность = 2 Тогда
		ОблШапкаПериод.Параметры.Дата = Формат(НачалоНедели(Стр.Значение),ФорматДаты)+" - "+Формат(КонецНедели(Стр.Значение),ФорматДаты);
		Иначе
		ОблШапкаПериод.Параметры.Дата = Формат(Стр.Значение,ФорматДаты);
		КонецЕсли;
	ТабДок.Присоединить(ОблШапкаПериод);
	КонецЦикла;
ТабДок.Присоединить(ОблШапкаИтого);
КолИтого = 0;
ТекПродукция = Справочники.Номенклатура.ПустаяСсылка();
		Для каждого ТЧ Из ТаблицаВыпуска Цикл	
			Если ТЧ.Продукция <> ТекПродукция Тогда
				Если ЗначениеЗаполнено(ТекПродукция) Тогда
				ОблПродукцияИтого.Параметры.КолИтого = КолИтого;
				ТабДок.Присоединить(ОблПродукцияИтого);				
				КонецЕсли; 
			ТекПродукция = ТЧ.Продукция;
			ОблПродукцияОбщие.Параметры.Линейка = ТЧ.Линейка;
			ОблПродукцияОбщие.Параметры.Продукция = ТЧ.Продукция;
			ОблПродукцияОбщие.Параметры.Наименование = ТЧ.Наименование;  
			ТабДок.Вывести(ОблПродукцияОбщие);	
			КолИтого = 0;		
			КонецЕсли; 
		ОблПродукцияПериод.Параметры.Кол = ТЧ.Количество;
		КолИтого = КолИтого + ТЧ.Количество;
		ТабДок.Присоединить(ОблПродукцияПериод);
		КонецЦикла; 
ОблПродукцияИтого.Параметры.КолИтого = КолИтого;
ТабДок.Присоединить(ОблПродукцияИтого);
ТабДок.Вывести(ОблКонецОбщие);
	Для каждого Стр Из СписокПериодов Цикл
	Выбор = ТаблицаВыпуска.НайтиСтроки(Новый Структура("Дата",Стр.Значение));
	КолВсего = 0;
		Для к = 0 По Выбор.Количество()-1 Цикл
		КолВсего = КолВсего + Выбор[к].Количество;
		КонецЦикла; 
	ОблКонецПериод.Параметры.КолВсего = КолВсего;
	ТабДок.Присоединить(ОблКонецПериод);
	КонецЦикла;
ОблКонецИтого.Параметры.КолВсего = ТаблицаВыпуска.Итог("Количество");
ТабДок.Присоединить(ОблКонецИтого);
ТабДок.ФиксацияСверху = 2;
ТабДок.ФиксацияСлева = 2;
ТабДок.РазмерСтраницы = "A4";
ТабДок.ПолеСверху = 0;
ТабДок.ПолеСлева = 0;
ТабДок.ПолеСнизу = 0;
ТабДок.ПолеСправа = 0;
ТабДок.РазмерКолонтитулаСверху = 0;
ТабДок.РазмерКолонтитулаСнизу = 0;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ЭтаФорма.ПроверитьЗаполнение() Тогда
	Состояние("Обработка...",,"Формирование отчёта...");	
	СформироватьНаСервере();		
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция НастройкиНаСервере()
Настройки = Новый Структура;
Настройки.Вставить("СписокЛинеек",СписокЛинеек);
Возврат(Новый Структура("КлючНазначенияИспользования,Настройки","ВыпускПродукцииПоПериодам",Настройки));
КонецФункции

&НаКлиенте
Процедура Настройки(Команда)
Результат = ОткрытьФормуМодально("ОбщаяФорма.НастройкиФорм",НастройкиНаСервере());
	Если Результат <> Неопределено Тогда	
	СписокЛинеек = Результат.СписокЛинеек;
	КонецЕсли;
КонецПроцедуры
